<?php
/**
 * 主要是学习下array_column的用法
 */

$arr = [['goods_id'=>1,'image'=>'1'],['goods_id'=>2,'image'=>'2'],['goods_id'=>1,'image'=>'3']];

$newArr = array_column($arr,'image','goods_id');

var_export($newArr);

/***********************************************************************
 *  输出：
 *  array ( 1 => '3', 2 => '2', )
 *
 *  column有重复的时候，取得值是最后一个
 * 
 ***********************************************************************/


$empty = array_column($arr,'nothing');

var_export($empty);


/***********************************************************************
 *  输出：
 *  array ()
 *
 *
 ***********************************************************************/

